Core/src/DataProcessors/ФормированиеДокументовДоставки/ФормированиеДокументовДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеДокументовДоставки</name>
</mdclass:DataProcessor>

Core/src/Enums/СостоянияДоставкиЗаказа/СостоянияДоставкиЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДоставкиЗаказа</name>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленЧастично</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлен</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СостоянияОплатыЗаказа/СостоянияОплатыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОплатыЗаказа</name>
  <enumValues>
    <name>НеОплачен</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>ОплаченНаличными</name>
  </enumValues>
  <enumValues>
    <name>ОплаченКартой</name>
  </enumValues>
  <enumValues>
    <name>КомбинированнаяОплата</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВариантыЗавершенияЗаказа/ВариантыЗавершенияЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗавершенияЗаказа</name>
  <enumValues>
    <name>Успешно</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ОперацияПоПлатежнымКартам/ОперацияПоПлатежнымКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияПоПлатежнымКартам</name>
  <basedOn>Document.ПриемИПередачаВРемонт</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЭквайрингу</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.СуммовойУчетВРознице</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПодотчетниками</registerRecords>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетод</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаПлатежнымиКартами</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыОтложенные</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетодЭквайринг</registerRecords>
  <registerRecords>AccumulationRegister.ЗакупкиДляКУДиР</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыНераспределенные</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <comment>Банковский счет для эквайринговых операций</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЭквайринга</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ПеремещениеДСПлан</types>
      <types>DocumentRef.ПоступлениеДСПлан</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаЭТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияПоПлатежнымКартамШапка</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссииПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайрерБеретКомиссиюЗаВозвратДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПередачаВА</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОПереработке</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПриемИПередачаВРемонт</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПриемИПередачаВРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПланирования</name>
      <type>
        <types>DocumentRef.ПеремещениеДСПлан</types>
        <types>DocumentRef.ПоступлениеДСПлан</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Catalogs/СостоянияЗаказовПокупателей/СостоянияЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаказовПокупателей</name>
  <predefined>
    <items>
      <name>ВПроцесеСбора</name>
      <description>აგროვების პროცეში</description>
    </items>
    <items>
      <name>Собран</name>
      <description>აგროვებულია</description>
    </items>
    <items>
      <name>ВыгруженНаБорт</name>
      <description>გადატვირთულია ბორტზე</description>
    </items>
    <items>
      <name>Завершен</name>
      <description>დასრულებულია</description>
    </items>
    <items>
      <name>Доставлен</name>
      <description>მიწოდებულია</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьРеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаказовПокупателей</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДоставлен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОтгружен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОжидаетОтгрузки</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/ФормированиеДокументовДоставки/ManagerModule.bsl
#Область ФоновоеЗадание

Процедура СформироватьДокументы(Параметры, ВременноеХранилищеРезультата) Экспорт
	
	Результат = Новый Структура;
	Ошибки = Новый СписокЗначений;
	
	Если НЕ Параметры.Свойство("ПланДоставки") ИЛИ ТипЗнч(Параметры.ПланДоставки)<>Тип("ДеревоЗначений") Тогда
		Ошибка = НСтр("ka='Не задан план доставки';ru='Не задан план доставки';en='Not specified delivery schedule'");
		Ошибки.Добавить(, Ошибка);
		Результат.Вставить("Ошибки", Ошибки);
		ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
		Возврат;
	КонецЕсли;
	
	ПланДоставки = Параметры.ПланДоставки;
	
	КоличествоСтрок = 0;
	Для каждого Стр Из ПланДоставки.Строки Цикл
	    Если Стр.СостояниеОтгрузкиИзменено ИЛИ Стр.СостояниеОплатыИзменено Тогда
			КоличествоСтрок = КоличествоСтрок+1;
		КонецЕсли; 
	КонецЦикла;
	
	ОбновляемыеРеквизиты = Новый Соответствие;
	
	НомерСтроки = 0;
	Для каждого Стр Из ПланДоставки.Строки Цикл
		
		Если НЕ Стр.СостояниеОтгрузкиИзменено И НЕ Стр.СостояниеОплатыИзменено Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураРеквизитов = Новый Структура;
		
		Если Стр.СостояниеОтгрузкиИзменено Тогда
			СоздатьОбновитьДокументыОтгрузки(Стр, Ошибки);
			СтруктураРеквизитов.Вставить("СостояниеОтгрузкиИзменено", Ложь);
			СтруктураРеквизитов.Вставить("ДокументОтгрузки", Стр.ДокументОтгрузки);
			Если Стр.СостояниеОтгрузки=Перечисления.СостоянияДоставкиЗаказа.Доставлен Тогда
				СтруктураРеквизитов.Вставить("МожноМенятьСостояниеОтгрузки", Ложь);
			КонецЕсли; 
		КонецЕсли; 
		
		Если Стр.СостояниеОплатыИзменено Тогда
			СоздатьОбновитьДокументыОплаты(Стр, Ошибки);
			СтруктураРеквизитов.Вставить("СостояниеОплатыИзменено", Ложь);
			СтруктураРеквизитов.Вставить("ДокументОплаты", Стр.ДокументОплаты);
			Если Стр.СостояниеОплаты<>Перечисления.СостоянияОплатыЗаказа.НеОплачен Тогда
				СтруктураРеквизитов.Вставить("МожноМенятьСостояниеОплаты", Ложь);
			КонецЕсли; 
		КонецЕсли;
		
		ОбновляемыеРеквизиты.Вставить(Стр.Группировка, СтруктураРеквизитов);
		
		НомерСтроки = НомерСтроки+1;
		ДлительныеОперации.СообщитьПрогресс(Окр(НомерСтроки/КоличествоСтрок*100), Стр.ПредставлениеГруппировки, ОбновляемыеРеквизиты);
		
	КонецЦикла;
	
	Если Ошибки.Количество()>0 Тогда
		Результат.Вставить("Ошибки", Ошибки);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
	
КонецПроцедуры

Процедура СоздатьОбновитьДокументыОтгрузки(Стр, Ошибки)
	
	Если Стр.СостояниеОтгрузки=Перечисления.СостоянияДоставкиЗаказа.Доставлен И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		// Обновление расходной накладной
		Если ЗначениеЗаполнено(Стр.ДокументОтгрузки) Тогда
			Док = Стр.ДокументОтгрузки.ПолучитьОбъект();
		Иначе
			Док = Документы.РасходнаяНакладная.СоздатьДокумент();
			Док.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Попытка
			Док.Заполнить(Стр.Группировка);
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Стр.ДокументОтгрузки = Док.Ссылка;
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ka='Не удалось обновить данные расходной накладной по заказу %1: %2';ru='Не удалось обновить данные расходной накладной по заказу %1: %2';en='Failed to update data on the expenditure invoice request% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Если Док.ЭтоНовый() Тогда
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			Иначе
				Ошибки.Добавить(Док.Ссылка, Ошибка);
			КонецЕсли; 
		КонецПопытки; 
		
		// Обновление состояния заказа
		НовоеСостояниеЗаказа = СостояниеДоставлен(Стр.Группировка);
		Если Стр.Группировка.СостояниеЗаказа<>НовоеСостояниеЗаказа Тогда
			Заказ = Стр.Группировка.ПолучитьОбъект();
			Заказ.СостояниеЗаказа = НовоеСостояниеЗаказа;
			Если НовоеСостояниеЗаказа=Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
				Заказ.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
			КонецЕсли; 
			Попытка
				Заказ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Информация = ИнформацияОбОшибке();
				СообщенияПользователю = ПолучитьСообщенияПользователю();
				Ошибка = СтрШаблон(НСтр("ka='Не удалось обновить состояние заказа %1: %2';ru='Не удалось обновить состояние заказа %1: %2';en='Failed to update order status% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			КонецПопытки; 
		КонецЕсли;
		
	ИначеЕсли Стр.СостояниеОтгрузки=Перечисления.СостоянияДоставкиЗаказа.НеДоставлен И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		// Возврат отгруженных документов
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заказ", Стр.Группировка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ПО РасходнаяНакладная.Ссылка = ПриходнаяНакладная.ДокументОснование
		|			И (ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя))
		|ГДЕ
		|	РасходнаяНакладная.Заказ = &Заказ
		|	И РасходнаяНакладная.Проведен
		|	И ПриходнаяНакладная.Ссылка ЕСТЬ NULL";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокВозврат = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокВозврат.Заполнить(Выборка.Ссылка);
			ДокВозврат.Дата = ТекущаяДатаСеанса();
			Попытка
				ДокВозврат.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Информация = ИнформацияОбОшибке();
				СообщенияПользователю = ПолучитьСообщенияПользователю();
				Ошибка = СтрШаблон(НСтр("ka='Не удалось сформировать возврат по заказу %1: %2';ru='Не удалось сформировать возврат по заказу %1: %2';en='Unable to generate a return on the order of% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			КонецПопытки; 
		КонецЦикла; 
		
	ИначеЕсли Стр.СостояниеОтгрузки=Перечисления.СостоянияДоставкиЗаказа.ДоставленЧастично И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ДоставленныеТовары = Новый Массив;
		Для каждого СтрНоменклатура Из Стр.Строки Цикл
			Если ТипЗнч(СтрНоменклатура.Группировка)<>Тип("СправочникСсылка.Номенклатура") Тогда
				Продолжить;
			КонецЕсли; 
			Если СтрНоменклатура.СостояниеОтгрузки=Перечисления.СостоянияДоставкиЗаказа.Доставлен Тогда
				ДоставленныеТовары.Добавить(СтрНоменклатура.Группировка);
			КонецЕсли; 
		КонецЦикла;  
		
		Если ЗначениеЗаполнено(Стр.ДокументОтгрузки) Тогда
			Док = Стр.ДокументОтгрузки.ПолучитьОбъект();
		Иначе
			Док = Документы.РасходнаяНакладная.СоздатьДокумент();
			Док.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		Попытка
			Док.Заполнить(Стр.Группировка);
			СтрокиКУдалению = Новый Массив;
			Для каждого СтрЗапас Из Док.Запасы Цикл
				Если ДоставленныеТовары.Найти(СтрЗапас.Номенклатура)=Неопределено Тогда
					СтрокиКУдалению.Добавить(СтрЗапас);
				КонецЕсли; 
			КонецЦикла;
			Для каждого СтрЗапас Из СтрокиКУдалению Цикл
				Док.Запасы.Удалить(СтрЗапас);
			КонецЦикла; 
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Стр.ДокументОтгрузки = Док.Ссылка;
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ka='Не удалось выполнить частичную отгрузку по заказу %1: %2';ru='Не удалось выполнить частичную отгрузку по заказу %1: %2';en='Unable to make a partial shipment of the order of% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Если Док.ЭтоНовый() Тогда
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			Иначе
				Ошибки.Добавить(Док.Ссылка, Ошибка);
			КонецЕсли; 
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОбновитьДокументыОплаты(Стр, Ошибки)
	
	Если (Стр.СостояниеОплаты=Перечисления.СостоянияОплатыЗаказа.НеОплачен ИЛИ Стр.Оплачено=0) И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		// Удаление оплат
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заказ", Стр.Группировка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка
		|ИЗ
		|	Документ.ПоступлениеВКассу.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Заказ = &Заказ
		|	И ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Заказ = &Заказ
		|	И ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка
		|ИЗ
		|	Документ.ОперацияПоПлатежнымКартам.РасшифровкаПлатежа КАК ОперацияПоПлатежнымКартамРасшифровкаПлатежа
		|ГДЕ
		|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Заказ = &Заказ
		|	И ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Заказ", Стр.Группировка);
		Пока Выборка.Следующий() Цикл
			Док = Выборка.Ссылка.ПолучитьДокумент();
			СтрокиКУдалению = Док.РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрРасшифровки Из СтрокиКУдалению Цикл
				Док.РасшифровкаПлатежа.Удалить(СтрРасшифровки);
			КонецЦикла;
			Попытка
				Если Док.РасшифровкаПлатежа.Количество()=0 Тогда
					Док.УстановитьПометкуУдаления(Истина);
				Иначе
					Док.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли; 
			Исключение
				Информация = ИнформацияОбОшибке();
				СообщенияПользователю = ПолучитьСообщенияПользователю();
				Ошибка = СтрШаблон(НСтр("ka='Не отменить оплату заказа %1: %2';ru='Не отменить оплату заказа %1: %2';en='Do not cancel the payment order% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
				Ошибки.Добавить(Выборка.Ссылка, Ошибка);
			КонецПопытки; 
		КонецЦикла;
		
	ИначеЕсли Стр.СостояниеОплаты=Перечисления.СостоянияОплатыЗаказа.ОплаченНаличными И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Если ЗначениеЗаполнено(Стр.ДокументОплаты) И ТипЗнч(Стр.ДокументОплаты)=Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
			Док = Стр.ДокументОплаты.ПолучитьОбъект();
		Иначе
			Если ЗначениеЗаполнено(Стр.ДокументОплаты) 
				И ТипЗнч(Стр.ДокументОплаты)<>Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
				Док = Стр.ДокументОплаты.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Истина);
			КонецЕсли; 
			Док = Документы.ПоступлениеВКассу.СоздатьДокумент();
			Док.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		Попытка
			Если ЗначениеЗаполнено(Стр.ДокументОтгрузки) Тогда
				Док.Заполнить(Стр.ДокументОтгрузки);
			Иначе
				Док.Заполнить(Стр.Группировка);
			КонецЕсли;
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ka='Не зафиксировать оплату заказа %1: %2';ru='Не зафиксировать оплату заказа %1: %2';en='Do not fix the order to pay% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Если Док.ЭтоНовый() Тогда
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			Иначе
				Ошибки.Добавить(Док.Ссылка, Ошибка);
			КонецЕсли; 
		КонецПопытки; 
		
	ИначеЕсли Стр.СостояниеОплаты=Перечисления.СостоянияОплатыЗаказа.ОплаченКартой И ТипЗнч(Стр.Группировка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Если ЗначениеЗаполнено(Стр.ДокументОплаты) 
			И (ТипЗнч(Стр.ДокументОплаты)=Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") 
			ИЛИ ТипЗнч(Стр.ДокументОплаты)=Тип("ДокументСсылка.ПоступлениеНаСчет")) Тогда
			Док = Стр.ДокументОплаты.ПолучитьОбъект();
		Иначе
			Если ЗначениеЗаполнено(Стр.ДокументОплаты) 
				И ТипЗнч(Стр.ДокументОплаты)<>Тип("ДокументСсылка.ОперацияПоПлатежнымКартам")
				И ТипЗнч(Стр.ДокументОплаты)<>Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
				Док = Стр.ДокументОплаты.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Истина);
			КонецЕсли; 
			Док = Документы.ОперацияПоПлатежнымКартам.СоздатьДокумент();
			Док.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		Попытка
			Если ЗначениеЗаполнено(Стр.ДокументОтгрузки) Тогда
				Док.Заполнить(Стр.ДокументОтгрузки);
			Иначе
				Док.Заполнить(Стр.Группировка);
			КонецЕсли;
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ka='Не зафиксировать оплату заказа %1: %2';ru='Не зафиксировать оплату заказа %1: %2';en='Do not fix the order to pay% 1% 2'"), Стр.ПредставлениеГруппировки, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Если Док.ЭтоНовый() Тогда
				Ошибки.Добавить(Стр.Группировка, Ошибка);
			Иначе
				Ошибки.Добавить(Док.Ссылка, Ошибка);
			КонецЕсли; 
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция СостояниеДоставлен(Заказ)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ВидЗаказа");
	Иначе
		ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
	КонецЕсли;
	СостояниеЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЗаказа, "СостояниеДоставлен");
	
	Возврат СостояниеЗаказа;
	
КонецФункции

Функция РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю = Неопределено)
	
	Ошибка = КраткоеПредставлениеОшибки(Информация)+?(Информация.Причина=Неопределено, "", Символы.ПС+РекурсивноеОписаниеОшибки(Информация.Причина));
	Если СообщенияПользователю<>Неопределено Тогда
		Для каждого Сообщение Из СообщенияПользователю Цикл
			Если Найти(Сообщение.Текст, ДлительныеОперации.СообщениеПрогресса()) > 0 Тогда
				Продолжить;
			КонецЕсли;
			Ошибка = Ошибка+Символы.ПС+Сообщение.Текст;
		КонецЦикла; 
	КонецЕсли; 
	Возврат Ошибка	
	
КонецФункции
 
#КонецОбласти
